<?php
/**
 * Created by PhpStorm.
 * User: 南丞
 * Date: 2019/3/6
 * Time: 13:39
 *
 *
 *                      _ooOoo_
 *                     o8888888o
 *                     88" . "88
 *                     (| ^_^ |)
 *                     O\  =  /O
 *                  ____/`---'\____
 *                .'  \\|     |//  `.
 *               /  \\|||  :  |||//  \
 *              /  _||||| -:- |||||-  \
 *              |   | \\\  -  /// |   |
 *              | \_|  ''\---/''  |   |
 *              \  .-\__  `-`  ___/-. /
 *            ___`. .'  /--.--\  `. . ___
 *          ."" '<  `.___\_<|>_/___.'  >'"".
 *        | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *        \  \ `-.   \_ __\ /__ _/   .-` /  /
 *  ========`-.____`-.___\_____/___.-`____.-'========
 *                       `=---='
 *  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *           佛祖保佑       永无BUG     永不修改
 *
 */

//\pf\route\Route::get('/', function () {
//    return 'root';
//});
//
//\pf\route\Route::get('show', function () {
//    return '大爷的';
//});
//
//\pf\route\Route::get('show/b/{id}', function () {
//    return 'pfinal社区';
//});

\pf\route\Route::get('user/{id}/{name?}', function ($id, $name) {
    return $id . '-' . $name;
})->where(['id' => '[0-9]+']);
